# Case Study (Use Pandas/NumPy/SciPy): A movie rating data set which provides movie ratings, movie metadata (genres and year), and demographic data about the users (age, zip code, gender, and occupation) is given. Write a program to find out the rating disagreement between men and women.

We need to find the movies that are most divisive between male and female viewers. One way is to add a column to mean_ratings containing the difference in means, then sort by that. Sorting by 'diff' gives us the movies with the greatest rating difference and which were preferred by women.

In [1]:
import warnings
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
users = pd.read_csv('C://Users//parde//Documents//ml-100k//u.user', sep='|', 
                    names=['user_id', 'age' , 'gender','occupation','zip code'])

In [3]:
users.head()

   user_id  age gender  occupation zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
ratings = pd.read_csv('C://Users//parde//Documents//ml-100k//u.data', sep='\t',
                      names=['user_id', 'movie_id', 'rating', 'rating_timestamp']
                      )

In [5]:
ratings.head()

   user_id  movie_id  rating  rating_timestamp
0      196       242       3         881250949
1      186       302       3         891717742
2       22       377       1         878887116
3      244        51       2         880606923
4      166       346       1         886397596

In [6]:
users_df=users.loc[:,['user_id','gender']]

In [7]:
ratings_df=ratings.loc[:,['user_id','rating']]

In [8]:
rating_df=pd.merge(users_df , ratings_df)

In [9]:
rating_df

       user_id gender  rating
0            1      M       4
1            1      M       3
2            1      M       4
3            1      M       4
4            1      M       4
...        ...    ...     ...
99995      943      M       1
99996      943      M       4
99997      943      M       3
99998      943      M       4
99999      943      M       2

[100000 rows x 3 columns]

In [10]:
rating_df.groupby('gender').rating.std()

gender
F    1.170951
M    1.109556
Name: rating, dtype: float64

In [11]:
rating_df.groupby('gender').rating.apply(pd.Series.std)

gender
F    1.170951
M    1.109556
Name: rating, dtype: float64

In [12]:
df1 = rating_df.groupby(['user_id','gender']).apply(np.mean)

In [13]:
df1.groupby('gender').rating.std()

gender
F    0.481241
M    0.430076
Name: rating, dtype: float64

In [14]:
pd.pivot_table(df1,values='rating',index='gender',aggfunc = pd.Series.std)

          rating
gender
F       0.481241
M       0.430076

In [21]:
t =pd.pivot_table(rating_df,index=['user_id','gender'],values='rating')

In [22]:
Female=t.query("gender ==['F']")

In [23]:
X=pd.Series.std(Female)

In [24]:
Male=t.query("gender ==['M']")

In [25]:
Y=pd.Series.std(Male)

In [26]:
pd.concat([X, Y]).drop_duplicates(keep=False)

rating    0.481241
rating    0.430076
dtype: float64